[
    {
        "recipeID": 25,
        "recipeName": "Crockpot Chili",
        "recipeImageName": "chili.jpg",
        "recipeDifficulty": "Intermediate",
        "recipeServingSize": 6,
        "recipePrepTime": "25 minutes",
        "recipeDescription": "Heat cooking oil in 2 quart skillet.\r\nSaute onions and peppers for 5 minutes.\r\nAdd spices and stir for 30 seconds.\r\nAdd meat and cook until browned. Approximately 15 minutes.\r\nPour contents of skillet into 3 quart crock pot.\r\nRinse beans and place in crockpot.\r\nOpen and pour Tomato puree and sauce into crock pot.\r\nCover crockpot and cook on low for 6 hours.\r\nServe into individual bowls and top with sour cream and cheese.\r\n"
    },
    {
        "recipeID": 27,
        "recipeName": "Flaky Pie Crust",
        "recipeImageName": "pieCrust.jpg",
        "recipeDifficulty": "Beginner",
        "recipeServingSize": 3,
        "recipePrepTime": "1 hour",
        "recipeDescription": "Blend cold Lard, Butter, and Flour in food processor until small clumps of fat form, about the size of peas. \r\nAdd the Egg, Vodka, Sugar, and Salt and blend until combined. Don't over blend.\r\nAdd the Ice Water one tablespoon at a time until dough begins to clump together.\r\nTake dough out of food processor and form into a flat circle, chill for 30 minutes or until ready to use.\r\nUse as usual for baked pies. \r\nTo pre-bake crust, roll out and shape pie crust in a pie tin, then add pie weights and back at 375 degrees for 15-20 minutes, or until golden brown. Remove pie weights halfway through."
    },
    {
        "recipeID": 31,
        "recipeName": "Carmel Apple Pie",
        "recipeImageName": "applePie.jpg",
        "recipeDifficulty": "Advanced",
        "recipeServingSize": 8,
        "recipePrepTime": "1 hour",
        "recipeDescription": "Preheat oven to 350 degrees. Form pie crust in pie dish, freeze for at least 15 minutes before baking. Mix larger amount of Flour, Brown Sugar, Rolled Oats, and half the Cinnamon in a mixing bowl for Crisp topping. Cut in the butter with the Crisp topping ingredients. In a separate saucepan, add Apples, Sugar, Honey, Vanilla Extract, half the Cinnamon, and smaller amount of Flour. Let mixture come to a boil and boil for around 1 minute. Remove crust from freezer and pour Apple mixture into crust and top with Crisp topping. Bake in 350 degree oven for 45 minutes. Example pie was decorated with leftover pastry that was baked separate from pie."
    },
    {
        "recipeID": 32,
        "recipeName": "Fresh Strawberry Pie",
        "recipeImageName": "strawberryPie.jpg",
        "recipeDifficulty": "Intermediate",
        "recipeServingSize": 8,
        "recipePrepTime": "30 minutes plus 3 hours to chill",
        "recipeDescription": "Slice half of the Strawberries and puree the other half. Arrange Sliced Strawberries in the bottom of pre baked Pie Crust. Mix the Pureed Strawberries and Sugar in a saucepan over medium heat and bring to a boil, stirring frequently. In a separate bowl, mix together Cornstarch and Water. Gradually mix in the Cornstarch mixture with the Strawberry mixture. Reduce the heat and let simmer until thickened, about 5-10 minutes, stirring constantly. Mix in both Vanilla and Almond extract. Pour puree mixture over strawberries in pie shell. Let chill for around 3 hours or more before serving to allow pie to set up. "
    },
    {
        "recipeID": 33,
        "recipeName": "Chocolate Chip Cookies",
        "recipeImageName": "cookies.jpg",
        "recipeDifficulty": "Beginner",
        "recipeServingSize": 32,
        "recipePrepTime": "30 minutes",
        "recipeDescription": "Preheat oven to 350 degrees. Cream Butter and Sugar. Add in Vanilla and Eggs, mix until combined. Add Espresso Powder if using, Baking Soda, and Salt. Stir in Flour until almost combined, then mix in Chocolate. Scoop around 2 Tbsp size of cookie dough and put on cookie sheets, evenly spaced apart. Bake for 10-13 minutes until edges are golden brown. Makes around 32 medium sized cookies."
    },
    {
        "recipeID": 42,
        "recipeName": "Peach Almond Pie",
        "recipeImageName": "peachPie.jpg",
        "recipeDifficulty": "Intermediate",
        "recipeServingSize": 8,
        "recipePrepTime": "1 hour 15 minutes",
        "recipeDescription": "Mix Peaches, Sugar, Flour, Lemon Zest and Juice, Amaretto, Nutmeg, Cinnamon, Salt, and Butter together. Form one Pie Crust in pie tin, then spoon Peach filling into crust. Cover with second crust (if using). Mix Egg and Water together and brush over Pie Crust. Bake in a 375 degree F oven for 45-50 minutes. Pie shown in picture was baked without top crust. Pie Crust decoration was made with the second Pie crust and baked separately. "
    }
]